---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Erase(Autodesk.Revit.DB.Electrical.CorrectionFactor)
source: html/d4ecd569-0920-1bf7-fed5-fe5b9dd69d1f.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	CorrectionFactor item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.CorrectionFactor`)